[{"name":"Petteri","diaryItemList":[{"date":"2019-01-07","subject":"D-Day","diaryText":"This is it when it all begins... Tänään opittiin olemaan campuksella ja vähän siitä mikä on tulevien viikkojen tahti.","textID":1548998646185},{"date":"2019-01-11","subject":"Eka viikko","diaryText":"Tällä viikolla on opittu paljon Javascriptistä ja jotain on jopa ihan sisäistettykin ja osataan käyttää koodatessa.\nHurja tahti koko viikon mutta edelleen ollaan junan kyydissä.","textID":1548998734578},{"date":"2019-01-18","subject":"Toinen viikko","diaryText":"Toinen viikko tiivistä tahtia takana ja tällä viikolla opittiin NodeJS:llä koodaamista eli backendiä. \nPerjantaina onnistuttin hienosti testissä, kaikki onnistuivat. Saa nähdä mitä ensi viikon Checkpoin tuo tullessaan...","textID":1548998843543},{"date":"2019-01-25","subject":"Kolmas viikko","diaryText":"Tällä viikolla oli ensimmäinen ryhmä/parityöskentely. Se opetti yhdessä koodaamisen mallia ja kuinka sitä voisi tai pitäisi tehdä. Harjoitusta lisää ja tullaan siinäkin mestareiksi.\nTämän viikon checkpoint palautti syvän nöyryyden ja ymmärryksen siitä, että eihän me osata vielä yhtään mitään. Harjoitusta lisää ja ehkä jonain päivänä osataan jotain. ;)","textID":1548998975041},{"date":"2019-02-01","subject":"Yksi kolmasosa takana","diaryText":"Ja kaksi kolmasosaa vielä edessäpäin. Ensi viikolla tahti taas kiristyy, kun palataan normi opetukseen.\nTällä viikolla harjoiteltiin lisää tiimissä tekemistä, kun koodattiin miniprojekteja.\nKaikki onnistuivat hienosti ja lopputulokset näyttävät mahtavilta.\nSamalla oppi paljon itsestä ja siitä mitkä ovat vahvuudet ja heikkoudet tiimityöskentelyssä. Erityisesti ne omat heikkoudet... ;D","textID":1548999245890},{"date":"2018-12-10","subject":"Ennakko-opiskelun aloitus","diaryText":"Tänään saatiin vähän esimakua tulevasta ja tavattiin kaikki uudet mahtavat kanssaopiskelijat. Iso ryhmä ja todella erilaisia taustoja mutta kaikilla kova halu oppia koodaamaan.","textID":1548999328501},{"date":"2019-01-24","subject":"Git Day","diaryText":"Tänään ohjelmassa oli Gitin pikakurssi ja vaikutti selkeältä. Ei vaikea =)\n\nMutta totuus oli toisenlainen...Kun päästiin oikeasti käyttämään, niin eihän se ihan niin helpolla mennyt mutta harjoitus teki aloittelevan mestarin siinäkin.","textID":1549000237912}]},{"name":"Alice","diaryItemList":[{"date":"2019-01-01","subject":"First Day","diaryText":"This was my first day and I'm very excited to learn new things.","textID":253},{"date":"2019-01-16","subject":"Another Day in Paradise","diaryText":"Everything is going GREAT!!!! ","textID":793},{"date":"2019-02-03","subject":"Something new ","diaryText":"Always learning new things...","textID":679}]},{"name":"John","diaryItemList":[{"date":"2019-01-02","subject":"Wednesday","diaryText":"What a Day!! oh Boy!!","textID":844},{"date":"2019-01-03","subject":"Thursday","diaryText":"I'm learning.. sooo much. I can feel it!!","textID":979}]},{"name":"Will","diaryItemList":[{"date":"2019-01-09","subject":"Someday","diaryText":"Someday Someday Someday","textID":51}]},{"name":"Inari","diaryItemList":[{"date":"2019-01-23","subject":"Valmis?","diaryText":"Tämähän näyttää hyvältä. Vai näyttääkö?","textID":755}]},{"name":"Irmeli","diaryItemList":[{"date":"2019-01-11","subject":"Eka viikko","diaryText":"Ekalla viikolla Academyssa käytiin läpi aika perusjuttuja JavaScriptistä. Mm. haettiin avointa dataa XMLhttpRequest-oliolla ja käytiin läpi Jquery-syntaksia. Luulin tajunneeni Jqueryn, mutta en saanut sillä tehtyä perjantain koodaustestiä. Uusintaan meni. Harmitti.","textID":196},{"date":"2019-01-18","subject":"Toka viikko","diaryText":"Tokalla viikolla Academyssa tuli uusi opettaja, Toni. Toni opetti backend-juttuja Nodella. Opin tekemään web-serverin ja siihen Rest-api-rajapinnan, jonka kautta tietoa siirretään selaimelle. Vähän puhuttiin myös responsive webistä ja opin skaalaamaan sovellusta niin, että sitä on hyvä katsoa/käyttää sekä selaimella, tabletilla että mobiililla.","textID":536},{"date":"2019-01-25","subject":"Kolmas viikko","diaryText":"Kolmannella viikolla testattiin! Opin kirjoittamaan testikoodeja sekä serverille että client-puolen toiminnoille. Yhtenä päivänä oli Git- ja Bash-koulutusta. Git tuntui tosi monimutkaiselta! Keskiviikkona oli lyhyt ryhmätehtävä, jossa piti luoda fullstack-viestisovellus. Meidän ryhmä sekaantui Express generatoriin ja siinä Pugiin. Se oli virhe. Olisi ollut yksinkertaisempaa tehdä homma ilman generatoria ja Pugia.","textID":289},{"date":"2019-02-01","subject":"Neljäs viikko","diaryText":"Neljännellä viikolla tehtiin neljän hengen ryhmässä Peer-to-peer learning diary fullstackina. Opin tosi paljon ryhmässä toimimista. Lisäksi opin front end -koodausta ja teinkin sivuille paljon HTML- ja CSS-juttuja. Vähän pääsin onneksi myös tekemään serverillä put- ja delete-toimintoja. Ne ovat edelleen mulle haastavia, mutta eiköhän nekin pienellä lisäopilla vielä päähän jää.","textID":688}]},{"name":"John Jooseppi","diaryItemList":[{"date":"2009-09-16","subject":"Git commands","diaryText":"Today I learned cool GIT commands like:\nGit commit -am \"client.js changes\"\nGit status","textID":1549006208797}]},{"name":"Kamira Satsuma","diaryItemList":[{"date":"2017-10-05","subject":"JQuery Ready function","diaryText":"A page can't be manipulated safely until the document is \"ready.\" jQuery detects this state of readiness for you.\n\n$( document ).ready(function() {\n    console.log( \"ready!\" );\n});","textID":1549006823194},{"date":"2016-11-05","subject":"JavaScript Array push() Method","diaryText":"Way to add a new item to an array:\n\nvar fruits = [\"Banana\", \"Orange\", \"Apple\", \"Mango\"];\nfruits.push(\"Kiwi\");","textID":1549006872810},{"date":"2014-04-03","subject":"String.prototype.split()","diaryText":"The split() method splits a String object into an array of strings by separating the string into substrings, using a specified separator string to determine where to make each split.","textID":1549006955676},{"date":"2017-11-05","subject":"Css media queries","diaryText":"Media queries are a popular technique for delivering a tailored style sheet to different devices. To demonstrate a simple example, we can change the background color for different devices:\n\n@media screen and (max-width: 600px) {\n  .topnav a {\n    float: none;\n    width: 100%;\n  }\n}","textID":1549007590140}]}]